---
type: ScheduleFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 17
tags: [revit-api, class]
---

# ScheduleFilter

`Autodesk.Revit.DB.ScheduleFilter` · Revit 2024 · 17 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ScheduleFilter | — | `` |
| Constructor | ScheduleFilter | 2013 | `public ScheduleFilter ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDoubleValue | 2013 | `public double GetDoubleValue ()` |
| Method | GetElementIdValue | 2013 | `public ElementId GetElementIdValue ()` |
| Method | GetIntegerValue | 2013 | `public int GetIntegerValue ()` |
| Method | GetStringValue | 2013 | `public string GetStringValue ()` |
| Method | SetNullValue | 2013 | `public void SetNullValue ()` |
| Method | SetValue | — | `` |
| Property | FieldId | 2013 | `public ScheduleFieldId FieldId { get ; set ; }` |
| Property | FilterType | 2013 | `public ScheduleFilterType FilterType { get ; set ; }` |
| Property | IsDoubleValue | 2013 | `public bool IsDoubleValue { get ; }` |
| Property | IsElementIdValue | 2013 | `public bool IsElementIdValue { get ; }` |
| Property | IsIntegerValue | 2013 | `public bool IsIntegerValue { get ; }` |
| Property | IsNullValue | 2013 | `public bool IsNullValue { get ; }` |
| Property | IsStringValue | 2013 | `public bool IsStringValue { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |